Revit 2016 API
BoundaryConditions.associateWithLoad Method
Sets the Autodesk::Revit::DB::ElementId^ of Load to associate.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
[ObsoleteAttribute("This property is obsolete in Revit 2016. Use AssociatedLoadId property instead.")]
public bool associateWithLoad(
	ElementId elementToAssociateId
)
Visual Basic
<ObsoleteAttribute("This property is obsolete in Revit 2016. Use AssociatedLoadId property instead.")> _
Public Function associateWithLoad ( _
	elementToAssociateId As ElementId _
) As Boolean
Visual C++
[ObsoleteAttribute(L"This property is obsolete in Revit 2016. Use AssociatedLoadId property instead.")]
public:
bool associateWithLoad(
	ElementId^ elementToAssociateId
)
Parameters
elementToAssociateId
Type: Autodesk.Revit.DB.ElementId
The Autodesk::Revit::DB::ElementId^ of Load to associate.
Return Value
If the Autodesk::Revit::DB::ElementId^ was set returns true. Otherwise returns false.
Remarks
Autodesk::Revit::DB::ElementId^ may be set if the internal Load with the elementToAssociateId exist and it's type fit the BoundaryConditions type only.
See Also
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace